In [6]:
import pandas as pd 
import sqlite3

In [7]:
# connection
con = sqlite3.connect('test-db.db')

In [8]:
# cursor-object 
# helps execute any-command in this platform
cur = con.cursor()

# From Previous Class

In [9]:
# Create A DATABASE
cur.execute('''
CREATE TABLE IF NOT EXISTS employees(
            id INT PRIMARY KEY,
            name TEXT,
            age INT,
            dept VARCHAR,
            salary INT
            )
'''
);

In [10]:
# INSERTING data into the TABLE
cur.execute("""
            INSERT INTO employees(
                id, name, age, dept, salary
            )VALUES
            (1, 'BRIAN', 30, 'EDU', 120000),
            (2, 'SAMUEL', 15, 'IT', 540000),
            (3, 'PAMELA', 50, 'UON', 256000)
            """);
con.commit()

In [11]:
con.execute('''
            SELECT * FROM employees
''');
rows = cur.fetchall()
# display the result
rows

[]

In [ ]:
# Fetching the data
cur.execute("SELECT * FROM employees")
rows = cur.fetchall()
for row in rows:
    print(row)

# OR
# rows

(1, 'BRIAN', 30, 'EDU', 120000)
(2, 'SAMUEL', 15, 'IT', 540000)
(3, 'PAMELA', 50, 'UON', 256000)

[(1, 'BRIAN', 30, 'EDU', 120000),
 (2, 'SAMUEL', 15, 'IT', 540000),
 (3, 'PAMELA', 50, 'UON', 256000)]

In [13]:
# adding more similar
cur.execute("""
    INSERT INTO employees(
        id, name, age, dept, salary
    ) VALUES
    (7, 'BRIAN', 30, 'EDU', 120000),
    (8, 'SAMUEL', 15, 'IT', 540000),
    (9, 'PAMELA', 50, 'UON', 256000)
""");
con.commit()

# 23-02-2025 Class

on minute 35.50

In [14]:
# adding more similar
cur.execute("""
    INSERT INTO employees(
        id, name, age, dept, salary
    ) VALUES
    (10, 'Lucy', 33, 'ICT', 30000),
    (11, 'Pamela', 40, 'Finance', 80000),
    (12, 'Makena', 32, 'IT', 120000),
    (13, 'Jabes', 50, 'Operations', 95000)
""");
con.commit()

In [15]:
cur.execute('''SELECT * FROM employees''')
con.commit()
rows = cur.fetchall()
rows

[(1, 'BRIAN', 30, 'EDU', 120000),
 (2, 'SAMUEL', 15, 'IT', 540000),
 (3, 'PAMELA', 50, 'UON', 256000),
 (7, 'BRIAN', 30, 'EDU', 120000),
 (8, 'SAMUEL', 15, 'IT', 540000),
 (9, 'PAMELA', 50, 'UON', 256000),
 (10, 'Lucy', 33, 'ICT', 30000),
 (11, 'Pamela', 40, 'Finance', 80000),
 (12, 'Makena', 32, 'IT', 120000),
 (13, 'Jabes', 50, 'Operations', 95000)]

# AS aliases

In [28]:
# fetching aliases (AS)
cur.execute('''SELECT AVG(salary) AS avg_salary  FROM employees
            ''');
con.commit()
rows = cur.fetchall()
rows

[(215700.0,)]

In [29]:
import math
import numpy as np
# np.mean(rows)

In [31]:
# fetching aliases (AS)
cur.execute('''SELECT dept, AVG(salary) AS avg_salary  FROM employees
            GROUP  BY dept
            ORDER BY salary ASC
            ''');
con.commit()
rows = cur.fetchall()
rows

[('ICT', 30000.0),
 ('Finance', 80000.0),
 ('Operations', 95000.0),
 ('EDU', 120000.0),
 ('UON', 256000.0),
 ('IT', 400000.0)]

In [32]:
# fetching aliases (AS)
cur.execute('''SELECT dept, AVG(salary) AS avg_salary  FROM employees
            GROUP  BY dept
            ORDER BY salary DESC
            ''');
con.commit()
rows = cur.fetchall()
rows

[('IT', 400000.0),
 ('UON', 256000.0),
 ('EDU', 120000.0),
 ('Operations', 95000.0),
 ('Finance', 80000.0),
 ('ICT', 30000.0)]

# CASE STATEMENT

# LIKE: Conditional Statement

In [35]:
# data filtering using conditional operator 
# (is null, between, is NOT null)
cur.execute('''
        SELECT * FROM employees
        WHERE name LIKE '_A_%'
''');
con.commit()
rows = cur.fetchall()
rows

[(2, 'SAMUEL', 15, 'IT', 540000),
 (3, 'PAMELA', 50, 'UON', 256000),
 (8, 'SAMUEL', 15, 'IT', 540000),
 (9, 'PAMELA', 50, 'UON', 256000),
 (11, 'Pamela', 40, 'Finance', 80000),
 (12, 'Makena', 32, 'IT', 120000),
 (13, 'Jabes', 50, 'Operations', 95000)]

In [36]:
cur.execute('''
        SELECT * FROM employees
        WHERE name LIKE '_A%'
''');
con.commit()
rows = cur.fetchall()
rows

[(2, 'SAMUEL', 15, 'IT', 540000),
 (3, 'PAMELA', 50, 'UON', 256000),
 (8, 'SAMUEL', 15, 'IT', 540000),
 (9, 'PAMELA', 50, 'UON', 256000),
 (11, 'Pamela', 40, 'Finance', 80000),
 (12, 'Makena', 32, 'IT', 120000),
 (13, 'Jabes', 50, 'Operations', 95000)]

In [39]:
cur.execute('''
        SELECT * FROM employees
        WHERE name LIKE 'P%'
''');
con.commit()
rows = cur.fetchall()
rows

[(3, 'PAMELA', 50, 'UON', 256000),
 (9, 'PAMELA', 50, 'UON', 256000),
 (11, 'Pamela', 40, 'Finance', 80000)]

In [41]:
# minute: 1:04:25
cur.execute('''
        SELECT * FROM employees
        WHERE salary BETWEEN 50000 AND 100000
''');
con.commit()
rows = cur.fetchall()
# print
for row in rows:
    print(row)

(11, 'Pamela', 40, 'Finance', 80000)
(13, 'Jabes', 50, 'Operations', 95000)

In [59]:
# minute: 1:07:15
# filter data using CASE STATEMENT
cur.execute('''
        SELECT 
            *,
        CASE 
            WHEN dept = 'IT'
                THEN dept = "DATA ANALYST" 
            WHEN dept = 'Operations' 
                THEN dept = 'Administrator'
            END AS roles
        FROM employees

''');
con.commit()
rows = cur.fetchall()
# Alert
print('\nNotice: the comma after *\n')

# print
for row in rows:
    print(row)
# rows

Notice: the comma after *

(1, 'BRIAN', 30, 'EDU', 120000, None)
(2, 'SAMUEL', 15, 'IT', 540000, 0)
(3, 'PAMELA', 50, 'UON', 256000, None)
(7, 'BRIAN', 30, 'EDU', 120000, None)
(8, 'SAMUEL', 15, 'IT', 540000, 0)
(9, 'PAMELA', 50, 'UON', 256000, None)
(10, 'Lucy', 33, 'ICT', 30000, None)
(11, 'Pamela', 40, 'Finance', 80000, None)
(12, 'Makena', 32, 'IT', 120000, 0)
(13, 'Jabes', 50, 'Operations', 95000, 0)

In [62]:
# minute: 1:07:15
# filter data using CASE STATEMENT
cur.execute('''
        SELECT 
            *,
        CASE 
            WHEN dept = 'EDU' THEN dept = "EDUCATION" 
        ELSE "Executives"
        END AS roles
        FROM employees

''');
con.commit()
rows = cur.fetchall()
# Alert
print('\nNotice: the comma after *\n')

# print
for row in rows:
    print(row)
# rows

Notice: the comma after *

(1, 'BRIAN', 30, 'EDU', 120000, 0)
(2, 'SAMUEL', 15, 'IT', 540000, 'Executives')
(3, 'PAMELA', 50, 'UON', 256000, 'Executives')
(7, 'BRIAN', 30, 'EDU', 120000, 0)
(8, 'SAMUEL', 15, 'IT', 540000, 'Executives')
(9, 'PAMELA', 50, 'UON', 256000, 'Executives')
(10, 'Lucy', 33, 'ICT', 30000, 'Executives')
(11, 'Pamela', 40, 'Finance', 80000, 'Executives')
(12, 'Makena', 32, 'IT', 120000, 'Executives')
(13, 'Jabes', 50, 'Operations', 95000, 'Executives')

In [61]:
cur.execute('''
    SELECT 
        *,
        CASE 
            WHEN dept = 'EDU' THEN 'EDUCATION'
            WHEN dept = 'IT' THEN 'TECHNOLOGY'
            ELSE 'Executives'
        END AS roles
    FROM employees
''')

con.commit()
rows = cur.fetchall()
rows

[(1, 'BRIAN', 30, 'EDU', 120000, 'EDUCATION'),
 (2, 'SAMUEL', 15, 'IT', 540000, 'TECHNOLOGY'),
 (3, 'PAMELA', 50, 'UON', 256000, 'Executives'),
 (7, 'BRIAN', 30, 'EDU', 120000, 'EDUCATION'),
 (8, 'SAMUEL', 15, 'IT', 540000, 'TECHNOLOGY'),
 (9, 'PAMELA', 50, 'UON', 256000, 'Executives'),
 (10, 'Lucy', 33, 'ICT', 30000, 'Executives'),
 (11, 'Pamela', 40, 'Finance', 80000, 'Executives'),
 (12, 'Makena', 32, 'IT', 120000, 'TECHNOLOGY'),
 (13, 'Jabes', 50, 'Operations', 95000, 'Executives')]

In [67]:
cur.execute("""
        SELECT *,
            CASE 
                WHEN dept = 'EDU' THEN 'EDUCATION' 
                WHEN dept = 'IT' THEN 'DATA ANAYLST'
                ELSE 'Officers'
            END AS roles
        FROM employees
""");
con.commit()
case_query = cur.fetchall()
case_query

[(1, 'BRIAN', 30, 'EDU', 120000, 'EDUCATION'),
 (2, 'SAMUEL', 15, 'IT', 540000, 'DATA ANAYLST'),
 (3, 'PAMELA', 50, 'UON', 256000, 'Officers'),
 (7, 'BRIAN', 30, 'EDU', 120000, 'EDUCATION'),
 (8, 'SAMUEL', 15, 'IT', 540000, 'DATA ANAYLST'),
 (9, 'PAMELA', 50, 'UON', 256000, 'Officers'),
 (10, 'Lucy', 33, 'ICT', 30000, 'Officers'),
 (11, 'Pamela', 40, 'Finance', 80000, 'Officers'),
 (12, 'Makena', 32, 'IT', 120000, 'DATA ANAYLST'),
 (13, 'Jabes', 50, 'Operations', 95000, 'Officers')]